Qala_Mobile_app/src/DataProcessors/РабочийСтол/РабочийСтол.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РабочийСтол</name>
</mdclass:DataProcessor>

Qala_Mobile_app/src/InformationRegisters/Уведомления/Уведомления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Уведомления</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Показан</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Qala_Mobile_app/src/DataProcessors/РабочийСтол/Forms/Форма/Module.bsl
&НаКлиенте
Процедура КомандаОткрытьВЗ(Команда)
	ОткрытьФорму("Документ.ВнутреннийЗаказ.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОткрытьЗаказПоставщику(Команда)
	ОткрытьФорму("Документ.ЗаказПоставщику.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчеты(Команда)
	ОткрытьФорму("Обработка.Монитор.Форма.Форма");
КонецПроцедуры

&НаКлиенте
Процедура УведомленияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = Элементы.Уведомления.ТекущиеДанные;
	ОткрытьЗначение(ТекДанные.Документ);
КонецПроцедуры

&НаСервере
Процедура ОчиститьУведомленияНаСервере()
	НаборЗаписей = РегистрыСведений.Уведомления.СоздатьНаборЗаписей();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры


&НаСервере
Функция ПолучитьКоличествоУведомлений()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	УведомленияСрезПоследних.Период КАК Период,
	               |	УведомленияСрезПоследних.Документ КАК Документ,
	               |	УведомленияСрезПоследних.Показан КАК Показан
	               |ИЗ
	               |	РегистрСведений.Уведомления.СрезПоследних КАК УведомленияСрезПоследних
	               |ГДЕ
	               |	НЕ УведомленияСрезПоследних.Показан";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество();	
КонецФункции	


&НаСервере
Функция УведомленяИмеются() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	УведомленияСрезПоследних.Документ КАК Документ
	               |ИЗ
	               |	РегистрСведений.Уведомления.СрезПоследних КАК УведомленияСрезПоследних";
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество() > 0;
КонецФункции	


&НаКлиенте
Процедура ОчиститьУведомления(Команда)
	
	ЕстьУведомления = УведомленяИмеются();
	Если ЕстьУведомления Тогда 
		Оповещение = Новый ОписаниеОповещения("ПроверкаОтвета", ЭтотОбъект);
		
		ТекстВопроса = "Очистить уведомления?";
		
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе 
		ОчиститьУведомленияНаСервере();
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаОтвета(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ОчиститьУведомленияНаСервере();
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура КомандаОткрытьЗаявки(Команда)
	ОткрытьФорму("Документ.ЗаявкиНаРсходованиеСредств.ФормаСписка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//КоличествоУведомлений = ПолучитьКоличествоУведомлений();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекстHTML()
	//УстановитьТекстHTMLНаСервере();
	//КаталогКартнок = КаталогВременныхФайлов();
	//
	////Лого = КаталогКартнок +  "Лого.jpg";
	//
	//ВременныйФайл  = ПолучитьИмяВременногоФайла();
	//
	//ДД = БиблиотекаКартинок.Лого.ПолучитьДвоичныеДанные();
	//ДД.Записать(ВременныйФайл);
	//
	//Сообщить(ВременныйФайл);
	
	
	СтрокаЛого = ПолучитьDataUrlКартинки(БиблиотекаКартинок.Лого);
	
HTML = "<HTML><HEAD>
|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type></META><LINK rel=stylesheet type=text/css href=""__STYLE__""></LINK>
|<META name=GENERATOR content=""MSHTML 11.00.9600.17037""></META><BASE href=""v8config://1407b3dc-3678-40f8-8d54-9c0d6f62a1ff/mdobject/id6ad2b92b-6642-4d79-aaa5-1a978c55491a/8eb4fad1-1fa6-403e-970f-2c12dbb43e23""></BASE></HEAD>
|<BODY>
|<P align=center><IMG style=""HEIGHT: 242px; WIDTH: 249px"" src=""data:image/png;base64," + СтрокаЛого + """ width=227 align=middle height=225></IMG></P>
|<P align=center></P>
|<DIV align=center><IMG src=""../../mdpicture/id894afc03-9904-465d-b671-f555ffb9b21c/00000000-0000-0000-0000-000000000000""></IMG>&nbsp;&nbsp; <A href=""../id7fb8f465-7641-4c22-87c8-61d88ae82aba/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">Внутренние заказы</A></DIV>
|<DIV align=center>&nbsp;</DIV>
|<DIV align=center><IMG src=""../../mdpicture/id8ac19694-383a-457a-b050-0a3ee937f5f3/00000000-0000-0000-0000-000000000000""></IMG>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <A href=""../id6d50f273-c095-4d33-b8fe-ff9b4e0a25e1/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">Заказы поставщику</A></DIV>
|<P align=center><IMG src=""../../mdpicture/id6c2759b1-2b63-4fa5-8d13-75786c7e1e89/00000000-0000-0000-0000-000000000000""></IMG>&nbsp;&nbsp;&nbsp; <A href=""../id452ba8c2-1640-4d32-bd85-88ad622a54c4/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">Заявки на расходование средств</A></P>
|<P></P>
|<P align=center><A href=""../idb5c159ee-c90a-4248-af96-5281ef8f5d41/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">&nbsp;<IMG src=""../../mdpicture/idf3c1376a-d2ee-46c4-9e44-aa2f7dae31c4/00000000-0000-0000-0000-000000000000""></IMG>&nbsp; Отчеты</A></P>
|<P></P></BODY></HTML>";

//HTML = "<html>
//                |<head>
//                |<meta http-equiv='Content-Type' content='text/html; charset=utf-8'>
//                |</head>
//                |<body>
//                |<img src = ""data:image/png;base64," + СтрокаЛого + """>
//                |</body>
//                |</html>";

КонецПроцедуры	


&НаСервереБезКонтекста
Функция ПолучитьDataUrlКартинки(Знач Картинка)
    Если Картинка = Неопределено Тогда
        Картинка = Новый Картинка;
    КонецЕсли;
    Стр = Base64Строка(Картинка.ПолучитьДвоичныеДанные());
	Стр = СтрЗаменить(Стр, Символ(10), "");
	Стр = СтрЗаменить(Стр, Символ(13), "");
    Возврат Стр;
КонецФункции

&НаСервере
Процедура УстановитьТекстHTMLНаСервере()
	
	КаталогКартнок = КаталогВременныхФайлов();
	
	Лого = КаталогКартнок +  "Лого.jpg";
	
	ДД = БиблиотекаКартинок.Лого.ПолучитьДвоичныеДанные();
	ДД.Записать(Лого);
	
	Сообщить(Лого);
	
//	HTML = "<HTML><HEAD>
//|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type></META><LINK rel=stylesheet type=text/css href=""__STYLE__""></LINK>
//|<META name=GENERATOR content=""MSHTML 11.00.9600.17037""></META><BASE href=""v8config://1407b3dc-3678-40f8-8d54-9c0d6f62a1ff/mdobject/id6ad2b92b-6642-4d79-aaa5-1a978c55491a/8eb4fad1-1fa6-403e-970f-2c12dbb43e23""></BASE></HEAD>
//|<BODY>
//|<P align=center><IMG style=""HEIGHT: 242px; WIDTH: 249px"" src=" + Лого + " width=227 align=middle height=225></IMG></P>
//|<P align=center></P>
//|<DIV align=center><IMG src=""../../mdpicture/id894afc03-9904-465d-b671-f555ffb9b21c/00000000-0000-0000-0000-000000000000""></IMG>&nbsp;&nbsp; <A href=""../id7fb8f465-7641-4c22-87c8-61d88ae82aba/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">Внутренние заказы</A></DIV>
//|<DIV align=center>&nbsp;</DIV>
//|<DIV align=center><IMG src=""../../mdpicture/id8ac19694-383a-457a-b050-0a3ee937f5f3/00000000-0000-0000-0000-000000000000""></IMG>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <A href=""../id6d50f273-c095-4d33-b8fe-ff9b4e0a25e1/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">Заказы поставщику</A></DIV>
//|<P align=center><IMG src=""../../mdpicture/id6c2759b1-2b63-4fa5-8d13-75786c7e1e89/00000000-0000-0000-0000-000000000000""></IMG>&nbsp;&nbsp;&nbsp; <A href=""../id452ba8c2-1640-4d32-bd85-88ad622a54c4/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">Заявки на расходование средств</A></P>
//|<P></P>
//|<P align=center><A href=""../idb5c159ee-c90a-4248-af96-5281ef8f5d41/038b5c85-fb1c-4082-9c4c-e69f8928bf3a"">&nbsp;<IMG src=""../../mdpicture/idf3c1376a-d2ee-46c4-9e44-aa2f7dae31c4/00000000-0000-0000-0000-000000000000""></IMG>&nbsp; Отчеты</A></P>
//|<P></P></BODY></HTML>";
	
HTML = "<html>
                |<head>
                |<meta http-equiv='Content-Type' content='text/html; charset=utf-8'>
                |</head>
                |<body>
                |<img src = " + Лого + ">
                |</body>
                |</html>";	
	
		
КонецПроцедуры	


&НаКлиенте
Процедура ЗаполнитьЗначениеКоличествоУведомлений() Экспорт 
   КоличествоУведомлений = ПолучитьКоличествоУведомлений();	
   ПодключитьОбработчикОжидания("ЗаполнитьЗначениеКоличествоУведомлений",0.1,Истина);
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ЗаполнитьЗначениеКоличествоУведомлений",0.1,Истина);
	УстановитьТекстHTML();
КонецПроцедуры
